[ {
  "name" : "Thời kỳ tiền sử",
  "year" : null,
  "content" : null,
  "childPeriodList" : [ {
    "name" : "Thời đại đồ đá",
    "year" : null,
    "content" : "Khu vực nay là Việt Nam đã có người ở từ thời kỳ đồ đá cũ. Các nhà khảo cổ đã tìm ra các dấu vết người thượng cổ cư ngụ tại hang Thẩm Hoi, Thẩm Khuyên (Lạng Sơn), núi Đọ (Thanh Hóa), Thung Lang (Ninh Bình) và Nga Sơn, Thanh Hóa cách đây hàng trăm nghìn năm. Thời kỳ này mực nước biển thấp hơn, và Việt Nam khi đó nối liền với bán đảo Malaysia, đảo Java, Sumatra và Kalimantan của Indonesia, với khí hậu ẩm và mát hơn bây giờ. Người Việt cổ khai thác đá gốc (ba-dan) ở sườn núi, ghè đẽo thô sơ một mặt, tạo nên những công cụ mũi nhọn, rìa lưỡi dọc, rìa lưỡi ngang, nạo,... bỏ lại nơi chế tác những mảnh đá vỡ (mảnh tước). Những di tích ở núi Đọ được coi là bằng chứng cổ xưa nhất về sự có mặt của con người tại vùng đất Việt, khi tổ chức xã hội loài người chưa hình thành.",
    "dynastyList" : [ ]
  }, {
    "name" : "Thời đại đồ đồng đá",
    "year" : null,
    "content" : "Văn hóa Phùng Nguyên là một nền văn hóa tiền sử thuộc sơ kỳ thời đại đồ đồng, cuối thời đại đồ đá mới, cách đây chừng 4.000 năm đến 3.500 năm.[cần dẫn nguồn] Phùng Nguyên là tên một làng ở xã Kinh Kệ, huyện Lâm Thao, tỉnh Phú Thọ, nơi đầu tiên tìm ra các di chỉ của nền văn hóa này.",
    "dynastyList" : [ ]
  }, {
    "name" : "Thời đại đồ đồng",
    "year" : null,
    "content" : "Văn hóa Đồng Đậu là nền văn hóa thuộc thời kỳ đồ đồng ở Việt Nam cách ngày nay khoảng 3.000 năm, sau văn hóa Phùng Nguyên, trước văn hóa Gò Mun. Tên của nền văn hóa này đặt theo tên khu di tích Đồng Đậu ở thị trấn Yên Lạc, huyện Yên Lạc, tỉnh Vĩnh Phúc.",
    "dynastyList" : [ ]
  }, {
    "name" : "Thời đại đồ sắt",
    "year" : null,
    "content" : "Đến khoảng năm 1200 TCN, sự phát triển của kỹ thuật trồng lúa nước và đúc đồ đồng trong khu vực sông Mã và đồng bằng sông Hồng đã dẫn đến sự phát triển của nền văn hóa Đông Sơn, nổi bật với các trống đồng. Các vũ khí, dụng cụ và trống đồng được khai quật của văn hóa Đông Sơn minh chứng cho việc kỹ thuật đúc đồ đồng bắt nguồn từ đây, nhiều mỏ đồng nhỏ xưa đã được khai quật ở miền Bắc Việt Nam. Ở đây các nhà khảo cổ đã tìm thấy quan tài và lọ chôn hình thuyền, nhà sàn, và bằng chứng về phong tục ăn trầu và nhuộm răng đen.",
    "dynastyList" : [ ]
  } ]
}, {
  "name" : "Thời kỳ cổ đại",
  "year" : null,
  "content" : null,
  "childPeriodList" : [ {
    "name" : "Kỷ Hồng Bàng ",
    "year" : "?–258 TCN",
    "content" : null,
    "dynastyList" : [ {
      "name" : "Nước Xích Quỷ",
      "year" : null,
      "content" : "Là 1 nhà nước “liên bang”, lỏng lẻo của các bộ tộc người Việt cổ ở vùng Lĩnh Nam. Theo tương truyền, Kinh Dương Vương là Thủy tổ của dân tộc Việt Nam có con là Lạc Long Quân đã lấy Âu Cơ và sinh ra một bọc trăm trứng nở ra một trăm người con trai. Đây được xem là tổ tiên của người Bách Việt, có con trưởng là Hùng Vương nối ngôi.",
      "nameCountry" : null,
      "historicalKings" : [ ],
      "historicalSiteList" : [ ]
    }, {
      "name" : "Nhà nước Văn Lang",
      "year" : "258-218 TCN",
      "content" : "Sau khi nhà nước liên bang tan rã thì vào khoảng thế kỷ thứ 7 TCN, người Lạc Việt ở miền Bắc lúc bấy giờ đã xây dựng một nhà nước lấy tên là Văn Lang, do vua Hùng cai trị và đóng đô ở Phong Châu (Phú Thọ).",
      "nameCountry" : null,
      "historicalKings" : [ ],
      "historicalSiteList" : [ ]
    } ]
  }, {
    "name" : "Nhà Thục ",
    "year" : "khoảng 257 TCN – 208 TCN",
    "content" : "Vào khoảng thế kỷ thứ 3 TCN, Thục Phán của bộ Âu Lạc đã hợp lực cùng vua Hùng thứ 18 đánh bại quân xâm lược nhà Tần. Sau đó, sáp nhập Âu Việt và Lạc Việt thành Âu Lạc. Thục Phán lên ngôi, lấy hiệu là An Dương Vương lập lên nhà Thục và đóng đô ở Cổ Loa.",
    "dynastyList" : [ ]
  } ]
}, {
  "name" : "Thời kỳ Bắc thuộc",
  "year" : null,
  "content" : null,
  "childPeriodList" : [ {
    "name" : "Thời Bắc thuộc lần thứ I ",
    "year" : "208 TCN – 39",
    "content" : "Trong thời kỳ phong kiến phương Bắc đô hộ lần thứ nhất, Triệu Đà là quận ủy quận Nam Hải nhân lúc nhà Tần suy yếu đã giết Trưởng lại nhà Tần, chiếm giữ Lĩnh Nam rồi đem quân đi thôn tính lãnh thổ Âu Lạc, Mân Việt, Quế Lâm thành lập lên nhà Triệu, lấy tên nước là Nam Việt và kinh đô là Phiên Ngưng. Nhà Triệu tồn tại 5 đời vua gồm:Năm 111 TCN, Hán Vũ Đế đem 10 vạn quân đi thôn tính Nam Việt. Nhà Hán chia Nam Việt thành 9 quận bao gồm Đạm Nhĩ, Nam Hải, Hợp Phố, Uất Lâm, Thương Ngô, Giao Chỉ (Bắc Bộ nước ta), Cửu Chân (Thanh Hóa-Nghệ Tĩnh), Nhật Nam (Quảng Bình-Quảng Nam). Chúng thực hiện các chính sách cai trị tàn bạo và vô cùng khắc nghiệt.",
    "dynastyList" : [ ]
  }, {
    "name" : "Trưng Nữ Vương ",
    "year" : "40 – 43",
    "content" : "Cuộc khởi nghĩa của hai chị em Trưng Trắc Trưng Nhị diễn ra trong vòng 3 năm đã giúp quân ta đã chiếm được 65 thành trì ở các quận Giao Chỉ, Cửu Chân, Nhật Nam và Hợp Phố.Sau đó, do bị cô lập và quân đội còn sơ khai đã khiến 2 bà không chống cự nổi quân của Mã Viện. Cuối cùng, để giữ vẹn khí tiết thì 2 bà đã tuẫn tiết tại sông Hát.",
    "dynastyList" : [ ]
  }, {
    "name" : "Thời kỳ Bắc thuộc lần thứ II ",
    "year" : "43 – 543",
    "content" : "Sau nhà Hán, các triều đại phong kiến phương Bắc gồm Đông Ngô, nhà Tấn, Lưu Tống, Nam Tề và nhà Lương đã thay nhau đô hộ nước ta. Có rất nhiều cuộc khởi nghĩa đã nổi dậy nhưng tất cả đều không thành công.Một số cuộc khởi nghĩa tiêu biểu ở thời kỳ này có thể kể đến là khởi nghĩa anh em Triệu Quốc Đạt và Triệu Thị Trinh thời Đông Ngô, khởi nghĩa anh em Lý Trường Nhân và Lý Thúc Hiến thời Lưu Tống – Nam Tề.",
    "dynastyList" : [ ]
  }, {
    "name" : "Nhà Tiền Lý ",
    "year" : "544-602",
    "content" : "Trong thời kỳ bị đô hộ bởi nhà Lương, Lý Bôn hay còn gọi là Lý Bí đã đánh đuổi thành công quân Lương để thành lập nên nhà Tiền Lý hay gọi là nhà nước Vạn Xuân, đóng đô ở Long Biên.",
    "dynastyList" : [ ]
  }, {
    "name" : "Thời kỳ Bắc thuộc lần thứ III ",
    "year" : "602 – 905",
    "content" : "Đến năm 581, Trung Quốc lập ra nhà Tùy và đến năm 602, vua Tùy đem quân sang đánh nước ta. Lý Phật Tử xin hàng và nước ta lại rơi vào tay giặc ngoại bang phương Bắc. Sau khi nhà Tùy sụp đổ, nhà Đường đã cai trị nước ta.Một số cuộc khởi nghĩa tiêu biểu vào giai đoạn này phải kể đến: Khởi nghĩa Mai Thúc Loan (722), khởi nghĩa Phùng Hưng (766-791), khởi nghĩa Dương Thanh (819-820).",
    "dynastyList" : [ ]
  }, {
    "name" : "Thời kỳ tự chủ ",
    "year" : "905–938",
    "content" : "Vào năm 905, nhân lúc nhà Đường suy yếu Khúc Thừa Dụ đánh đuổi giặc Đường và tự xưng là Tiết độ sứ. Ông được Nhà Đường công nhận là người đứng đầu đất Việt và họ Khúc đã đặt nền móng cho nền độc lập của nước ta.",
    "dynastyList" : [ ]
  } ]
}, {
  "name" : "Thời kỳ quân chủ",
  "year" : null,
  "content" : null,
  "childPeriodList" : [ {
    "name" : "Thời kỳ độc lập",
    "year" : "939-1409",
    "content" : "",
    "dynastyList" : [ {
      "name" : "Triều đại nhà Ngô",
      "year" : "939 – 967",
      "content" : "Sau khi Ngô Quyền đánh đuổi được quân Nam Hán đã xưng vương và thành lập nên triều Ngô. Sau 28 năm trị vì, nhà Ngô bị tan rã dưới thời Ngô Xương Xí. Lúc này nước ta bị chia cắt thành 12 sứ quân.",
      "nameCountry" : " Vạn Xuân",
      "historicalKings" : [ ],
      "historicalSiteList" : [ ]
    }, {
      "name" : "Triều đại nhà Đinh",
      "year" : "968 – 980",
      "content" : "Đinh Bộ Lĩnh khi dẹp loạn được 12 sứ quân đã thống nhất đất nước và tạo nên nhà Đinh với tên nước là Đại Cồ Việt, đóng kinh tại Hoa Lư.",
      "nameCountry" : " Đại Cồ Việt",
      "historicalKings" : [ ],
      "historicalSiteList" : [ ]
    }, {
      "name" : "Triều đại Tiền Lê",
      "year" : "980 – 1010",
      "content" : "Trước tình hình nhà Tống lăm le xâm lược nên Thái hậu Dương Vân Nga đã hỗ trợ Lê Hoàn lên ngôi vua, mở ra triều Tiền Lê để lãnh đạo quân đội chống giặt ngoại xâm.",
      "nameCountry" : " Đại Cồ Việt",
      "historicalKings" : [ ],
      "historicalSiteList" : [ ]
    }, {
      "name" : "Triều đại nhà Lý",
      "year" : "1010 – 1225",
      "content" : "Thời nhà Lý tồn tại lâu dài hơn 200 năm lịch sử, có nhiều thành tựu đáng chú ý trong nhiều lĩnh vực khác nhau như Nho giáo, quân đội, nghệ thuật công trình kiến trúc,..",
      "nameCountry" : " Đại Cồ Việt, Đại Việt",
      "historicalKings" : [ ],
      "historicalSiteList" : [ ]
    }, {
      "name" : "Triều đại nhà Trần",
      "year" : "1225 – 1400",
      "content" : "Trong 10 triều đại phong kiến Việt Nam thì thời nhà Trần là giai đoạn hùng mạnh nhất của lực lượng quân đội. Chúng ta đã chiến thắng nhiều lần xâm phạm của các giặc Nguyên, Mông Cổ nhờ đội binh tinh nhuệ và nhiều tướng tài dẫn dắt. Nổi tiếng nhất là Hưng Đạo đại vương Trần Quốc Tuấn.",
      "nameCountry" : " Đại Việt",
      "historicalKings" : [ ],
      "historicalSiteList" : [ ]
    }, {
      "name" : "Triều đại nhà Hồ",
      "year" : "1400 – 1407",
      "content" : "Là triều đại phong kiến ngắn nhất trong lịch sử Việt Nam chỉ tồn tại trong vòng 7 năm.",
      "nameCountry" : " Đại Ngu",
      "historicalKings" : [ ],
      "historicalSiteList" : [ ]
    } ]
  }, {
    "name" : "Thời kỳ Bắc Thuộc lần thứ IV",
    "year" : "1413 – 1428",
    "content" : "Năm 1413, quân Minh phản kích khiến cuộc chiến giữa nhà Trần và quân Minh diễn ra rất ác liệt. Cuối cùng do lực lượng mỏng nên nhà Trần đã bị đánh bại. Vua tôi nhà Trần bị bắt toàn bộ và đã tự vẫn để giữ trọn khí tiết. Nước ta một lần nữa bị rơi vào tay giặc phương Bắc.",
    "dynastyList" : [ ]
  }, {
    "name" : "Thời kỳ Trung Hưng – Nhà Hậu Lê",
    "year" : "1428-1527",
    "content" : "",
    "dynastyList" : [ {
      "name" : "Triều đại nhà Hậu Lê",
      "year" : "1428 – 1788",
      "content" : "Là triều đại dài nhất trong lịch sử nước ta với 355 năm trị vì. Dưới thời Hậu Lê thì nước ta đã có nhiều phát triển từ quân sự, kinh tế, lãnh thổ. Nước ta đạt được nhiều sự thịnh vượng nhất.",
      "nameCountry" : " Đại Việt",
      "historicalKings" : [ ],
      "historicalSiteList" : [ ]
    } ]
  }, {
    "name" : "Thời kỳ chia cắt",
    "year" : "1527–1802",
    "content" : "",
    "dynastyList" : [ {
      "name" : "Triều đại nhà Mạc",
      "year" : "1527 – 1593",
      "content" : "Mạc Đăng Dung cướp ngôi vua Cung Hoàng tự xưng đế và lập ra nhà Mạc. Triều đại này đánh đấu sự chia cắt thành 2 triều đại Nam triều và Bắc triều của nước ta. Trong đó triều Mạc nằm ở Bắc triều.",
      "nameCountry" : " Đại Việt",
      "historicalKings" : [ ],
      "historicalSiteList" : [ ]
    } ]
  }, {
    "name" : "Thời kỳ thống nhất",
    "year" : "1788-1858",
    "content" : "",
    "dynastyList" : [ {
      "name" : "Triều đại thời Tây Sơn",
      "year" : "1788 – 1802",
      "content" : "Anh em nhà Tây Sơn của Nguyễn Huệ đã khởi nghĩa để thống nhất Đàng Trong. Đến khi Nguyễn Phúc Ánh hòng muốn lấy lại cơ nghiệp nên đã 2 lần cấu kết giặc Xiêm và giặc Thanh để đem quân đánh chiếm nước ta.",
      "nameCountry" : " Đại Việt",
      "historicalKings" : [ ],
      "historicalSiteList" : [ ]
    }, {
      "name" : "Triều đại nhà Nguyễn",
      "year" : "1802 – 1945",
      "content" : "Là triều đại cuối cùng trong lịch sử phong kiến của nước ta. Vào thời nhà Nguyễn nước ta có phần lãnh thổ rộng lớn nhất.",
      "nameCountry" : " Việt Nam",
      "historicalKings" : [ ],
      "historicalSiteList" : [ ]
    } ]
  } ]
}, {
  "name" : "Thời kỳ hiện đại",
  "year" : null,
  "content" : null,
  "childPeriodList" : [ {
    "name" : "Thời kỳ Pháp đô hộ ",
    "year" : "1883-1945",
    "content" : "Ngày 31 tháng 8 năm 1858, Hải quân Pháp đã đổ bộ vào tấn công cảng Đà Nẵng rồi chiếm đóng Sài Gòn. Triều đình Huế do vua Tự Đức đứng đầu đã ký hiệp ước nhượng 3 tỉnh miền Đông cho Pháp rồi đến năm 1867, Pháp chiếm nốt 3 tỉnh miền Tây để tạo thành một lãnh thổ Nam Kỳ.",
    "dynastyList" : [ ]
  }, {
    "name" : "Nước Việt Nam từ 1945 – 1976",
    "year" : "1945-1976",
    "content" : "Năm 1946, dưới sự lãnh đạo của Nguyễn Ái Quốc, quân và dân ta đã đánh đổ Thực dân Pháp và Phát xít Nhật. Vào đúng ngày 2/9/1945, Chủ tịch Hồ Chí Minh đọc bản tuyên ngôn độc lập tại quảng trường Ba Đình và khai sinh ra nước Việt Nam Dân chủ Cộng Hòa với thủ đô là Hà Nội.",
    "dynastyList" : [ ]
  }, {
    "name" : "Chiến tranh Việt Nam ",
    "year" : "1955-1975",
    "content" : "Trong thời gian từ 1956-1958, dưới sự trợ giúp của Mỹ thì Ngô Đình Diệm – một vị quan thời vua Bảo Đại đã gian lận để chiến thắng cuộc trưng cầu ý dân nhằm xác định người lãnh đạo của Quốc gia Việt Nam.Sau này, Ngô Đình Diệm lên làm Tổng thống của nước Việt Nam Cộng Hòa phế truất vua Bảo Đại khiến ông phải lưu vong sang Pháp. Mỹ bắt đầu viện trợ cho chính quyền Ngô Đình Diệm để củng cố chính phủ thân Mỹ.Dưới thời Ngô Đình Diệm, hàng loạt các cuộc đàn áp chính trị và tôn giáo đã khiến trăm nghìn người thiệt mạng. Chính sách “Tố cộng, Diệt cộng”, gây ra các thảm sát, biểu tình Phật giáo diễn ra khắp nơi, mâu thuẫn tôn giáo sâu sắc. Đây chính là giai đoạn tăm tối và khổ sở nhất của người dân miền Nam Việt Nam.",
    "dynastyList" : [ ]
  }, {
    "name" : "Cộng hòa xã hội chủ nghĩa Việt Nam ",
    "year" : "1976 đến nay",
    "content" : "Năm 1954, Việt Nam Dân chủ Cộng hòa đánh tan ý định xâm lược lần thứ 2 của thực dân Pháp bằng chiến thắng Điện Biên Phủ để buộc Pháp phải ký Hiệp định Giơ-ne-vơ công nhận độc lập – chủ quyền và rút quân khỏi Đông Dương.Sau khi tiến hành nhiều cuộc chiến tranh mà không giành được thắng lợi thì vào ngày 27 tháng 1 năm 1973, Mỹ buộc phải ký Hiệp định Paris và rút chân ra khỏi miền Nam trong danh dự. Năm 1975, quân giải phóng miền Nam đã tổng tiến công và nổi dậy vào Sài Gòn lật đổ chính quyền Việt Nam Cộng Hòa và thống nhất đất nướNăm 1976, nước ta hoàn toàn được độc lập với tên gọi chính thức là Cộng Hòa Xã Hội Chủ Nghĩa Việt Nam có Đảng Cộng Sản Việt Nam, thủ đô Hà Nội và Sài Gòn đổi tên là Thành phố Hồ Chí Minh.",
    "dynastyList" : [ ]
  } ]
} ]